In [225]:
test_var = 10; print (test_var)

10

In [226]:
x1 = 10*2
x2 = 10  *  2
x3 = 10    *    2
print(x1) 
print(x2) 
print(x3)

20
20
20

In [227]:
var_length = 3
for i in range(var_length):
# دستور پرینت زیر که تو رفتگی دارد جز حلقه است
    print('Count', i)
print ('Outside the loop') # این دستور جز حلقه نیست

Count 0
Count 1
Count 2
Outside the loop

In [228]:
word = 'Example'
sentence = "This is an example of a sentence" 
para = '''This is a paragraph 
This is a paragraph
        This is a paragraph'''

In [229]:
S = "This is an example of a sentence" 
S[0]
S[0:6]

'This i'

In [230]:
var1 = 5 # این متغیر یک عدد صحیح است
var2 = 'This is a String' # این متغیر یک رشته است 
var3 = [1,2,3] # این متغیر یک لیست است

In [231]:
4*2

8

In [232]:
4*2+2

10

In [233]:
2**2+1

5

In [234]:
11%2

1

In [235]:
x=2; x+=2; print(x)

4

In [236]:
x=2;y=4; x<=y

True

In [237]:
# lists
list1 = [1,2,3] # لیست ساده با اعداد صحیح
list2 = [1, None, 'Python', 3.14] # لیست با داده‌های ترکیبی 
list2[2:] # از اندیس شماره 2 تا انتهای لیست

['Python', 3.14]

In [238]:
list1[0]='New'; list1

['New', 2, 3]

In [239]:
list3 = [ [1,2,3], [10,20,30], ['Example', 'Nested', 'List']] 
list3[0][0:2]

[1, 2]

In [240]:
list3[2][0]

'Example'

In [241]:
list4 = [1,2,3,4,2,2,2,1,5,8,0] # لیست با عناصر تکراری
list4.count(2)    #    تعداد عناصر با مقدار 2 را برمی‌گرداند
list4.append(100) #عدد 100 را به آخر لیست اضافه می‌کند
list4.pop(2)      #عنصر با شماره اندیس 2 را حذف می‌کند

list4

[1, 2, 4, 2, 2, 2, 1, 5, 8, 0, 100]

In [242]:
# tuples
tuple1 = (1,2,3) # تاپل ساده با اعداد صحیح
tuple2 = (1, None, 'Python', 3.14) # تاپل ترکیبی با انواع داده
# تاپل تودرتو
tuple3 = ([1,2,3], [10,20,30], ['Example', 'Nested', 'Tuple']) 
tuple4 = (1,2,3,3,2,2,2,1,5,8,0) # تاپل با عناصر تکراری
print (tuple1[0])
print (tuple2[-2]) 
print (tuple3[2][1]) 
print (tuple4.count(2)) 
print (tuple3[2][1:3]) 
print (tuple1 + tuple2)

1
Python
Nested
4
['Nested', 'Tuple']
(1, 2, 3, 1, None, 'Python', 3.14)

In [243]:
#tuple1[0]=5 #بدلیل تغییرناپذیر بودن تاپل با خطا مواجه می شویم

In [244]:
# Dictionary
a={'ML_Models':['ANN','SVM','RF','GB','XGB'], 'Score':[90,85,95,90,100]}

print(a)
print(a['ML_Models'])             #دسترسی به عناصر دیکشنری با استفاده از کلید
print(a['ML_Models'][0:3])

d={'a':{'inner_a':[1,2,3]}}       # دیکشنری تو در تو
print(d['a']['inner_a'][1])       #برای رسیدن به عنصر 2، ابتدا باید با 2 کلید به لیست مربوطه رسید سپس از اندیس استفاده کرد

{'ML_Models': ['ANN', 'SVM', 'RF', 'GB', 'XGB'], 'Score': [90, 85, 95, 90, 100]}
['ANN', 'SVM', 'RF', 'GB', 'XGB']
['ANN', 'SVM', 'RF']
2

In [245]:
# Sets
set1 = {1,2,3} # مجموعه ساده
set2 = set((1,None,'Python',3.14)) # setمجموعه ترکیبی و ساخته شده با دستور 
# ساخت مجموعه‌ی زیر بدلیل استفاده از لیست‌ها که تغییرپذیر هستند خطا می‌دهد
# set3 = {[1,2,3], [10,20,30], ['Example', 'Nested', 'List']} 
set4 = {1,2,3,3,2,2,2,1,5,8,0} # مجموعه‌ها عناصر تکراری نمی‌پذیرند بنابراین در خروجی، عناصر تکراری حذف شده‌اند
print(set1) 
print(set2) 
# print(set3) 
print(set4)

{1, 2, 3}
{1, 3.14, None, 'Python'}
{0, 1, 2, 3, 5, 8}

In [246]:
# example of if-elif-else
perm = 0.001 # input in millidarcy
if (perm > 0.0001):
    print ('This is a millidarcy case, seems to be a sandstone or limestone rock!')
elif (perm <= 0.0001 and perm>= 1E-6):
    print ('This is a microdarcy case, seems to be tight sand rock!')
else:
    print ('This is a nanodarcy case, seems to be shale rock!')

This is a millidarcy case, seems to be a sandstone or limestone rock!

In [247]:
for i in range(0,3):
    print('Iterator is = ', i) 
print('Loop Execution is complete!')

Iterator is =  0
Iterator is =  1
Iterator is =  2
Loop Execution is complete!

In [248]:
Frac_Crews=['Frac_Crew_1', 'Frac_Crew_2', 'Frac_Crew_3', 'Frac_Crew_4']
for x in Frac_Crews: 
   print(x) 
   if x=='Frac_Crew_2':
      break

Frac_Crew_1
Frac_Crew_2

In [249]:
for x in Frac_Crews: 
    if x=='Frac_Crew_2':
      continue
    print(x) # باشد if توجه کنید که تورفتگی پرینت برابر

Frac_Crew_1
Frac_Crew_3
Frac_Crew_4

In [250]:
i=1
while (i<4):
    print('i = ',i)
    i+=1
else:
    print('The End...')

i =  1
i =  2
i =  3
The End...

In [251]:
y=[5,6,7,8,9,10]
[x**2+3*x+100 for x in y]

[140, 154, 170, 188, 208, 230]

In [252]:
def Function1(a):
    b=a**2+5
    d=b*10
    return b,d
Function1(2)

(9, 90)

In [253]:
c=Function1(3)
print(c)

(14, 140)

In [254]:
import pandas as pd
dictionary={'Column_1':[10,20,30],'Columns_2':[40,50,60], 'Column_3':[70,80,90]}
dictionary=pd.DataFrame(dictionary)
dictionary

   Column_1  Columns_2  Column_3
0        10         40        70
1        20         50        80
2        30         60        90

In [255]:
dictionary=pd.DataFrame({'C1':[10,20,30],'C2':[40,50,60], 'C3':[70,80,90]}, index=['Row1', 'Row2', 'Row3'])
dictionary

      C1  C2  C3
Row1  10  40  70
Row2  20  50  80
Row3  30  60  90

In [256]:
a=[[1,2,3],[10,20,30],[100,200,300]]
FirstDF=pd.DataFrame(a,index='Row1 Row2 Row3'.split(),columns='Col1 Col2 Col3'.split())
FirstDF

      Col1  Col2  Col3
Row1     1     2     3
Row2    10    20    30
Row3   100   200   300

In [257]:
print('''----------------------------------
----------head Function-----------''')
print(FirstDF.head(2))
print('''----------------------------------
----------tail Function-----------''')
print(FirstDF.tail(2))

----------------------------------
----------head Function-----------
      Col1  Col2  Col3
Row1     1     2     3
Row2    10    20    30
----------------------------------
----------tail Function-----------
      Col1  Col2  Col3
Row2    10    20    30
Row3   100   200   300

In [258]:
FirstDF.describe()

             Col1        Col2        Col3
count    3.000000    3.000000    3.000000
mean    37.000000   74.000000  111.000000
std     54.744863  109.489726  164.234588
min      1.000000    2.000000    3.000000
25%      5.500000   11.000000   16.500000
50%     10.000000   20.000000   30.000000
75%     55.000000  110.000000  165.000000
max    100.000000  200.000000  300.000000

In [259]:
FirstDF.cumsum()
#FirstDF.cumsum(axis=1)

      Col1  Col2  Col3
Row1     1     2     3
Row2    11    22    33
Row3   111   222   333

In [260]:
FirstDF['Col1']*2+FirstDF['Col2']

Row1      4
Row2     40
Row3    400
dtype: int64

In [261]:
FirstDF['NewCol']=FirstDF['Col1']*2+FirstDF['Col2']
FirstDF

      Col1  Col2  Col3  NewCol
Row1     1     2     3       4
Row2    10    20    30      40
Row3   100   200   300     400

In [262]:
FirstDF['NewCol']=FirstDF['Col1']*2+FirstDF['Col2']
FirstDF['NewCol1']=FirstDF['NewCol']*2
FirstDF
FirstDF.drop(labels=['NewCol','NewCol1'],axis=1,inplace=True)
FirstDF.drop(labels=['Row3'],axis=0)
FirstDF

      Col1  Col2  Col3
Row1     1     2     3
Row2    10    20    30
Row3   100   200   300

In [263]:
FirstDF.loc[['Row1','Row3'],:]
FirstDF.iloc[[0,2],:]

      Col1  Col2  Col3
Row1     1     2     3
Row3   100   200   300

In [264]:
FirstDF.loc[['Row1','Row2'], ['Col1','Col2']]
FirstDF.iloc[0:2,0:2]

      Col1  Col2
Row1     1     2
Row2    10    20

In [265]:
FirstDF.iloc[2,1]

200

In [266]:
FirstDF>15

       Col1   Col2   Col3
Row1  False  False  False
Row2  False   True   True
Row3   True   True   True

In [267]:
FirstDF['Col2']>15 #فیلتر کردن یک ستون

Row1    False
Row2     True
Row3     True
Name: Col2, dtype: bool

In [268]:
FirstDF[FirstDF['Col2']>15] #فیلتر کردن سطری

      Col1  Col2  Col3
Row2    10    20    30
Row3   100   200   300

In [269]:
FirstDF[(FirstDF['Col1']>15) & (FirstDF['Col2']>15)]

      Col1  Col2  Col3
Row3   100   200   300

In [270]:
FirstDF[(FirstDF['Col1']>50) | (FirstDF['Col2']>=20)]

      Col1  Col2  Col3
Row2    10    20    30
Row3   100   200   300

In [271]:
FirstDF['NewCol1']=['A','A','B']; FirstDF['NewCol2']=['D','C','C']

In [272]:
FirstDF

      Col1  Col2  Col3 NewCol1 NewCol2
Row1     1     2     3       A       D
Row2    10    20    30       A       C
Row3   100   200   300       B       C

In [273]:
dfGroupBy=FirstDF.groupby('NewCol1')
dfGroupBy.mean(numeric_only=True)
# خروجی خط زیر مشابه دو خط فوق است
#FirstDF.groupby('NewCol1').mean(numeric_only=True)

          Col1   Col2   Col3
NewCol1
A          5.5   11.0   16.5
B        100.0  200.0  300.0

In [274]:
FirstDF.groupby(['NewCol1','NewCol2']).mean(numeric_only=True)

                  Col1   Col2   Col3
NewCol1 NewCol2
A       C         10.0   20.0   30.0
        D          1.0    2.0    3.0
B       C        100.0  200.0  300.0

In [275]:
A=pd.DataFrame([['A','B','C'],['D','E','F']],index=['Row1','Row2'])
A

      0  1  2
Row1  A  B  C
Row2  D  E  F

In [276]:
pd.concat([FirstDF,A])
#pd.concat([FirstDF,A],axis=1)

       Col1   Col2   Col3 NewCol1 NewCol2    0    1    2
Row1    1.0    2.0    3.0       A       D  NaN  NaN  NaN
Row2   10.0   20.0   30.0       A       C  NaN  NaN  NaN
Row3  100.0  200.0  300.0       B       C  NaN  NaN  NaN
Row1    NaN    NaN    NaN     NaN     NaN    A    B    C
Row2    NaN    NaN    NaN     NaN     NaN    D    E    F

In [277]:
A1=pd.DataFrame({'A':['X1','X2','X3','X4'],\

                 'B':['Y1','Y2','Y3','Y4'], 'unique_ID':['Z1','Z2','Z3',\

                                                         'Z5'],})
A1

    A   B unique_ID
0  X1  Y1        Z1
1  X2  Y2        Z2
2  X3  Y3        Z3
3  X4  Y4        Z5

In [278]:
A2=pd.DataFrame({'C':['L1','L2','L3','L4'],
'D':['M1','M2','M3','M4'], 'unique_ID':['Z1','Z2','Z3','Z6']})
A2

    C   D unique_ID
0  L1  M1        Z1
1  L2  M2        Z2
2  L3  M3        Z3
3  L4  M4        Z6

In [279]:
pd.merge(A1,A2, on='unique_ID', how='inner') #unique_ID اشتراک دو دیتافریم براساس ستون

    A   B unique_ID   C   D
0  X1  Y1        Z1  L1  M1
1  X2  Y2        Z2  L2  M2
2  X3  Y3        Z3  L3  M3

In [280]:
pd.merge(A1,A2, on='unique_ID', how='outer') #unique_ID اجتماع دو دیتافریم براساس ستون

     A    B unique_ID    C    D
0   X1   Y1        Z1   L1   M1
1   X2   Y2        Z2   L2   M2
2   X3   Y3        Z3   L3   M3
3   X4   Y4        Z5  NaN  NaN
4  NaN  NaN        Z6   L4   M4

In [281]:
B1=pd.DataFrame({'A':['L1','L2','L3','L4'],
'B':['M1','M2','M3','M4']}, index=['Z1','Z2','Z3','Z4'])
B1

     A   B
Z1  L1  M1
Z2  L2  M2
Z3  L3  M3
Z4  L4  M4

In [282]:
B2=pd.DataFrame({'C':['L1','L2','L3','L4'],
'D':['M1','M2','M3','M4']}, index=['Z1','Z2','Z3','Z6'])
B2

     C   D
Z1  L1  M1
Z2  L2  M2
Z3  L3  M3
Z6  L4  M4

In [283]:
B1.join(B2,how='inner') # اشتراک دو دیتافریم

     A   B   C   D
Z1  L1  M1  L1  M1
Z2  L2  M2  L2  M2
Z3  L3  M3  L3  M3

In [284]:
B1.join(B2,how='outer') # اجتماع دو دیتافریم

      A    B    C    D
Z1   L1   M1   L1   M1
Z2   L2   M2   L2   M2
Z3   L3   M3   L3   M3
Z4   L4   M4  NaN  NaN
Z6  NaN  NaN   L4   M4

In [285]:
A3=pd.DataFrame({'C':[1,1,1,3],
'D':[3,2,2,3], 'unique_ID':['Z1','Z2','Z2','Z6']})
#A3['C'].unique() # C عناصر یکتای ستون 
#A3.nunique()
#A3['C'].nunique() # C تعداد عناصر یکتای ستون
#A3.value_counts() # ردیفهای یکتای دیتافریم به همراه تعداد دفعات تکرار هرکدام
#A3['C'].value_counts() # C تعداد دفعات تکرار عناصر یکتای ستون 
#A3.columns
A3.sort_values('D',ascending=True)

   C  D unique_ID
1  1  2        Z2
2  1  2        Z2
0  1  3        Z1
3  3  3        Z6

In [286]:
def cubic (x):
    return x**3
A3['D'].apply(cubic)

0    27
1     8
2     8
3    27
Name: D, dtype: int64

In [287]:
A3['D'].apply(lambda x:x**3)

0    27
1     8
2     8
3    27
Name: D, dtype: int64

In [294]:
B3=B1.join(B2,how='outer')
#B3
#B3.dropna(how='any') # ردیفهای حاوی مقادیر گمشده را حذف می کند
#B3.dropna(how='any',axis=1) # ستونهای حاوی مقادیر گمشده را حذف می کند
#B3.fillna(value=0) # مقادیر گمشده را با صفر جایگزین می کند
#B3.fillna(method='ffill')
B3.fillna(method='bfill')

      A    B   C   D
Z1   L1   M1  L1  M1
Z2   L2   M2  L2  M2
Z3   L3   M3  L3  M3
Z4   L4   M4  L4  M4
Z6  NaN  NaN  L4  M4

In [296]:
B3.to_excel('B3.xlsx',sheet_name='B3sheet')

In [299]:
pd.read_excel('B3.xlsx',sheet_name='B3sheet')

  Unnamed: 0    A    B    C    D
0         Z1   L1   M1   L1   M1
1         Z2   L2   M2   L2   M2
2         Z3   L3   M3   L3   M3
3         Z4   L4   M4  NaN  NaN
4         Z6  NaN  NaN   L4   M4